ENCODING <- function(data,
                     ...){
  encoding = data %>%
    str_replace_all(., "ÌÊ", "à") %>%
    str_replace_all(., "Ì¬", "è") %>%
    str_replace_all(., "Ì©", "é") %>%
    str_replace_all(., "Ìä", "é") %>%
    str_replace_all(., "‰Ûª","'") %>%
    str_replace_all(., "Ì«", "ô") %>%
    str_replace_all(., "ÌÈ", "û") %>%
    str_replace_all(., "Ì»","ê") %>%
    str_replace_all(., "Ì¨", "î") %>%
    str_replace_all(., "Ì¢","â") %>%
    str_replace_all(., "Ì_","ù") %>%
    str_replace_all(., "ÌÈ","û") %>%
    str_replace_all(., "Ì¤","ç") %>%
    str_replace_all(., "ÌÛ", "À") %>%
    str_replace_all(., "ÌÇ", "ë") %>%
    str_replace_all(., '‰Û_', "etc")

  return(encoding)
}

ENCODING <- function(data,
                     ...){

  old = c("ÌÊ","Ì¬","Ì©",
          "Ìä","‰Ûª","Ì«",
          "ÌÈ","Ì»","Ì¨",
          "Ì¢","Ì_","ÌÈ",
          "Ì¤", "ÌÛ","ÌÇ",
          '‰Û_')

  new = c("à","è","é",
        "é", "'","ô",
        "û","ê","î",
        "â","ù","û",
        "ç","À","ë",
        "etc")


# name = Donnees %>%
#   map_df(.x = .,
#          .f = ~stringr::str_detect(string = .,
#                                    pattern =  "ÌÊ|Ì¬|Ì©|Ìä|‰Ûª|Ì«|ÌÈ|Ì»|Ì¨|Ì¢|Ì_|ÌÈ|Ì¤|ÌÛ|ÌÇ|‰Û_",
#                                    negate = FALSE))






  encoding = data %>%
    str_replace_all(., "ÌÊ", "à") %>%
    str_replace_all(., "Ì¬", "è") %>%
    str_replace_all(., "Ì©", "é") %>%
    str_replace_all(., "Ìä", "é") %>%
    str_replace_all(., "‰Ûª","'") %>%
    str_replace_all(., "Ì«", "ô") %>%
    str_replace_all(., "ÌÈ", "û") %>%
    str_replace_all(., "Ì»","ê") %>%
    str_replace_all(., "Ì¨", "î") %>%
    str_replace_all(., "Ì¢","â") %>%
    str_replace_all(., "Ì_","ù") %>%
    str_replace_all(., "ÌÈ","û") %>%
    str_replace_all(., "Ì¤","ç") %>%
    str_replace_all(., "ÌÛ", "À") %>%
    str_replace_all(., "ÌÇ", "ë") %>%
    str_replace_all(., '‰Û_', "etc")

  return(encoding)
}













data = "Le Démon, dans ma chambre haute" %>%
  enframe %>%
  mutate(test = "Le Démon, dans ma chambre haute")

translate_utf8_to_ascii <- function(data,
                                    ...){

 tab = data.frame(utf8 = c("À", "Á", "Â", "Ä", "Æ", "È", "É", "Ê",
                           "Ë", "Î", "Ï", "Í", "Ì", "Ô", "Ò", "Œ",
                           "Ü", "Ç", "à", "á", "â", "ä", "æ", "è",
                           "é", "ê", "ë", "î", "ï", "í", "ì", "ò",
                           "œ", "ü", "ç", "«", "»"),
                  ascii = c("A", "A", "A", "A", "Ae", "E", "E", "E",
                            "E", "I", "I", "I", "I", "O", "O", "Oe",
                            "U", "C", "a", "a", "a", "a", "ae", "e",
                            "e", "e", "e", "i", "i", "i", "i", "o",
                            "oe", "u", "c", "\"", "\""),
                  langue = rep("fr"),
                  stringsAsFactors = FALSE)


}





# new2old = array(
#   'á' => 'Ã¡',
#
#   'À' => 'Ã€',
#   'ä' => 'Ã¤',
#   'Ä' => 'Ã„',
#   'ã' => 'Ã£',
#   'å' => 'Ã¥',
#   'Å' => 'Ã…',
#   'æ' => 'Ã¦',
#   'Æ' => 'Ã†',
#   'ç' => 'Ã§',
#   'Ç' => 'Ã‡',
#   'é' => 'Ã©',
#   'É' => 'Ã‰',
#   'è' => 'Ã¨',
#   'È' => 'Ãˆ',
#   'ê' => 'Ãª',
#   'Ê' => 'ÃŠ',
#   'ë' => 'Ã«',
#   'Ë' => 'Ã‹',
#   'í' => 'Ã-',
#   'Í' => 'Ã',
#   'ì' => 'Ã¬',
#   'Ì' => 'ÃŒ',
#   'î' => 'Ã®',
#   'Î' => 'ÃŽ',
#   'ï' => 'Ã¯',
#   'Ï' => 'Ã',
#   'ñ' => 'Ã±',
#   'Ñ' => 'Ã‘',
#   'ó' => 'Ã³',
#   'Ó' => 'Ã“',
#   'ò' => 'Ã²',
#   'Ò' => 'Ã’',
#   'ô' => 'Ã´',
#   'Ô' => 'Ã”',
#   'ö' => 'Ã¶',
#   'Ö' => 'Ã–',
#   'õ' => 'Ãµ',
#   'Õ' => 'Ã•',
#   'ø' => 'Ã¸',
#   'Ø' => 'Ã˜',
#   'œ' => 'Å“',
#   'Œ' => 'Å’',
#   'ß' => 'ÃŸ',
#   'ú' => 'Ãº',
#   'Ú' => 'Ãš',
#   'ù' => 'Ã¹',
#   'Ù' => 'Ã™',
#   'û' => 'Ã»',
#   'Û' => 'Ã›',
#   'ü' => 'Ã¼',
#   'Ü' => 'Ãœ',
#   '€' => 'â‚¬',
#   '’' => 'â€™',
#   '‚' => 'â€š',
#   'ƒ' => 'Æ’',
#   '„' => 'â€ž',
#   '…' => 'â€¦',
#   '‡' => 'â€¡',
#   'ˆ' => 'Ë†',
#   '‰' => 'â€°',
#   'Š' => 'Å ',
#   '‹' => 'â€¹',
#   'Ž' => 'Å½',
#   '‘' => 'â€˜',
#   '“' => 'â€œ',
#   '•' => 'â€¢',
#   '–' => 'â€“',
#   '—' => 'â€”',
#   '˜' => 'Ëœ',
#   '™' => 'â„¢',
#   'š' => 'Å¡',
#   '›' => 'â€º',
#   'ž' => 'Å¾',
#   'Ÿ' => 'Å¸',
#   '¡' => 'Â¡',
#   '¢' => 'Â¢',
#   '£' => 'Â£',
#   '¤' => 'Â¤',
#   '¥' => 'Â¥',
#   '¦' => 'Â¦',
#   '§' => 'Â§',
#   '¨' => 'Â¨',
#   '©' => 'Â©',
#   'ª' => 'Âª',
#   '«' => 'Â«',
#   '¬' => 'Â¬',
#   '®' => 'Â®',
#   '¯' => 'Â¯',
#   '°' => 'Â°',
#   '±' => 'Â±',
#   '²' => 'Â²',
#   '³' => 'Â³',
#   '´' => 'Â´',
#   'µ' => 'Âµ',
#   '¶' => 'Â¶',
#   '·' => 'Â·',
#   '¸' => 'Â¸',
#   '¹' => 'Â¹',
#   'º' => 'Âº',
#   '»' => 'Â»',
#   '¼' => 'Â¼',
#   '½' => 'Â½',
#   '¾' => 'Â¾',
#   '¿' => 'Â¿',
#   'à' => 'Ã ',
#   '†' => 'â€ ',
#   '”' => 'â€',
#   'Á' => 'Ã',
#   'â' => 'Ã¢',
#   'Â' => 'Ã‚',
#   'Ã' => 'Ãƒ',
# )
#
# foreach( $new2old as $key => $value ) {
#   $new[] = $key;
#   $old[] = $value;
# }
#
#
# string_new = str_replace( $old, $new, $string );


